Repository: Phongsathron/Typora-i18n
Catalog: *.lproj/Front.strings
Languages: th_th

source: OK
th_th: ตกลง

source: Cancel
th_th: ยกเลิก

source: Yes
th_th: ใช่

source: No
th_th: ไม่ใช่

source: Close
th_th: ปิด

source: Select
th_th: เลือก

source: Continue
th_th: ต่อไป

source: Learn More…
th_th: อ่านเพิ่มเติม…

source: Untitled
th_th: ไม่มีหัวข้อ

source: Undo
th_th: เลิกทำ

source: Dismiss
th_th: ปล่อยผ่าน

source: Confirm
th_th: ยืนยัน

source: Error
th_th: ข้อผิดพลาด

source: Search
th_th: ค้นหา

source: Replace
th_th: แทนที่

source: All
th_th: ทั้งหมด

source: Search text not found in article
th_th: ไม่พบข้อความนี้ในบทความ

source: search text
th_th: ค้นหาข้อความ

source: Search by file name
th_th: ค้นหาจากชื่อไฟล์

source: Searching
th_th: กำลังค้นหา

source: Gathering more results
th_th: แสดงผลลัพธ์เพิ่มเติม

source: Insert Table
th_th: แทรกตาราง

source: Columns
th_th: คอลัมน์

source: Rows
th_th: แถว

source: Align Left
th_th: จัดชิดซ้าย

source: Align Center
th_th: จัดกึ่งกลาง

source: Align Right
th_th: จัดชิดขวา

source: Resize Table
th_th: ปรับขนาดตาราง

source: Delete Table
th_th: ลบตาราง

source: Copy Image To...
th_th: คัดลอกรูปไปที่...

source: Typora are trying copy the newly inserted image to folder <code id='image-create-folder-target'></code> according to your YAML Front Matter setting or global preferences. But the target folder does not exist, create it now?
th_th: Typora กำลังคัดลอกรูปที่แทรกเข้ามาล่าสุดไปที่โฟลเดอร์ <code id='image-create-folder-target'></code> ที่ตั้งค่าไว้ใน YAML หรือจากการตั้งค่าส่วนกลาง แต่ไม่พบโฟลเดอร์ที่กำหนดไว้ คุณต้องการสร้างโฟลเดอร์นั้นไหม?

source: Create Folder
th_th: สร้างโฟลเดอร์

source: Edit
th_th: แก้ไข

source: Delete Math
th_th: ลบสูตรคณิตศาสตร์

source: Preview
th_th: ดูตัวอย่าง

source: Articles
th_th: บทความ

source: Outline
th_th: เค้าโครง

source: Files
th_th: ไฟล์

source: Switch to File List view
th_th: สลับไปดูไฟล์ในมุมมองรายการ

source: Switch to File Tree view
th_th: สลับไปดูไฟล์ในมุมมองต้นไม้

source: Switch to Outline view
th_th: สลับไปดูเค้าโครง

source: Close sidebar
th_th: ปิดแถบข้าง

source: Loading
th_th: กำลังโหลด

source: Selected folders contains too many files. Please switch to <a id='switch-to-tree-on-oversize'>File Tree view</a> for better performance.
th_th: โฟล์เดอร์ที่เลือกมีไฟล์มากเกินไป กรุณาเปลี่ยนไป <a id='switch-to-tree-on-oversize'>ดูไฟล์ในมุมมองต้นไม้</a> เพื่อประสิทธิภาพที่ดีขึ้น

source: New File
th_th: สร้างไฟล์ใหม่

source: Unpin Outline Panel
th_th: ยกเลิกการปักหมุดแผงเค้าโครง

source: Open Folder...
th_th: เปิดโฟลเดอร์...

source: Action
th_th: การกระทำ

source: Close Sidebar Menu
th_th: ปิดเมนูแถบข้าง

source: Reveal in Finder
th_th: แสดงใน Finder

source: Reveal in File Explorer
th_th: แสดงใน File Explorer

source: Refresh Folder
th_th: โหลดโฟลเดอร์ใหม่

source: Sort
th_th: จัดเรียง

source: Group By Folder
th_th: จัดกลุ่มจากโฟลเดอร์

source: Sort Naturally
th_th: จัดเรียงแบบธรรมดา

source: Sort by Modification Date (Ascending)
th_th: เรียงจากวันที่แก้ไข (จากเก่าสุด - ล่าสุด)

source: Sort by Name (Descending)
th_th: เรียงจากชื่อ (จาก ฮ - ก)

source: Sort by Modification Date (Descending)
th_th: เรียงจากวันที่แก้ไข (จากล่าสุด - เก่าสุด)

source: Location
th_th: ตำแหน่ง

source: Switch File List/Tree View
th_th: สลับดูไฟล์ในมุมมองรายการ/ต้นไม้

source: No Files Available
th_th: ไม่มีไฟล์

source: No Folder is Opened.
th_th: ไม่มีโฟลเดอร์ถูกเปิด

source: Outline is Empty.
th_th: ไม่มีเค้าโครง

source: Toggle Sidebar
th_th: แสดงแถบข้าง

source: Toggle Source Code Mode
th_th: สลับเป็นโหมด Source Code

source: Exit Source Code Mode
th_th: ปิดโหมด Source Code

source: Table of Contents
th_th: สารบัญ

source: Empty Diagram
th_th: ไม่มีแผนภาพ

source: Input Math TeX here
th_th: ใส่ Math TeX ที่นี่

source: Need to define the reference footnote <b>{0}</b> with syntax <a>[^{1}]: www.example.com</a>
th_th: ต้องระบุการอ้างอิงเชิงอรรถ <b>{0}</b> ด้วยคำสั่ง <a>[^{1}]: www.example.com</a>

source: Need to define the reference link <b>[{0}]</b> with syntax <b>[{1}]: www.example.com</b>
th_th: ต้องระบุลิงก์อ้างอิง <b>[{0}]</b> ด้วยคำสั่ง <b>[{1}]: www.example.com</b>

source: Please define image reference by [{0}]: http://example.png
th_th: กรุณาระบุแหล่งอ้างอิงของภาพ ด้วยคำสั่ง [{0}]: http://example.png

source: Failed to create file
th_th: สร้างไฟล์ไม่สำเร็จ

source: Failed to create folder
th_th: สร้างโฟลเดอร์ไม่สำเร็จ

source: Failed to rename file
th_th: เปลี่ยนชื่อไฟล์ไม่สำเร็จ

source: Folder does not exist at %@
th_th: ไม่พบโฟลเดอร์ทีตำแหน่ง %@

source: File with the same name already exists at target path
th_th: มีไฟล์ชื่อนี้อยู่แล้วในตำแหน่งที่กำหนด

source: Apply to All
th_th: ปรับใช้ทั้งหมด

source: Overwrite
th_th: เขียนทับ

source: Stop
th_th: หยุด

source: back to document
th_th: กลับไปที่เอกสาร

source: Failed to load file
th_th: โหลดไฟล์ไม่สำเร็จ

source: Save File Failed!
th_th: บันทึกไฟล์ไม่สำเร็จ!

source: Cannot open folder {0}
th_th: ไม่สามารถเปิดโฟลเดอร์ {0}

source: File content is changed by external applications. Reload content from disk ?
th_th: เนื้อหาในไฟล์ถูกแก้ไขโดยแอปพลิเคชั่นภายนอก โหลดเนื้อหาใหม่?

source: Should continue moving and overwrite exisiting file(s) ?
th_th: ต้องการดำเนินการย้ายและเขียนทับไฟล์ที่มีอยู่แล้ว?

source: Rename to "{0}" ?
th_th: เปลี่ยนชื่อเป็น "{0}" ?

source: Failed to rename from "{0}" to "{1}"
th_th: เปลี่ยนชื่อจาก "{0}" เป็น "{1}" ไม่สำเร็จ

source: Successfully uploaded {0} images.
th_th: อัพโหลดรูปภาพ {0} สำเร็จ

source: Failed to upload image. Error Message:
th_th: อัพโหลดรูปภาพไม่สำเร็จ ข้อความอธิบายความผิดพลาด:

source: Failed to Copy Image to Target Folder.
th_th: คัดลอกรูปภาพไปที่โฟลเดอร์เป้าหมายไม่สำเร็จ

source: Select Container Folder
th_th: เลือกโฟลเดอร์ปัจจุบัน

source: Saved
th_th: บันทึกแล้ว

source: replace with
th_th: แทนที่ด้วย

source: Case Sensitive
th_th: ตรงตามตัวอักษรใหญ่ - เล็ก

source: Whole Word
th_th: ทั้งคำ

source: input image URL
th_th: ระบุ URL ของรูปภาพ

source: Select image from local file
th_th: เลือกรูปภาพจากไฟล์ในเครื่อง

source: Cannot open location <code>$1</code>, do you mean <a href='https://$3'>https://$2</a> ?
th_th: ไม่สามารถเปิด <code>$1</code>, คุณอาจหมายถึง <a href='https://$3'>https://$2</a> ?

source: select a language
th_th: เลือกภาษา

source: Finish Editing
th_th: แก้ไขเสร็จสิ้น

source: Revert advanced setting file to default one ?
th_th: ย้อนการตั้งค่าไฟล์ขั้นสูงเป็นค่าเริ่มต้น?

source: Select Spell Check Language
th_th: เลือกภาษาตรวจตัวสะกด

source: Auto Detect Language
th_th: ระบุภาษาอัตโนมัติ

source: Disable Spell Check
th_th: ปิดการตรวจตัวสะกด

source: Global Setting…
th_th: ตั้งค่าส่วนกลาง…

source: Dictionary file is missing to enable spellcheck support for %@.
th_th: ไฟล์พจนานุกรมเพื่อใช้ตรวจตัวสะกดสำหรับ %@ หายไป

source: Install Language Support
th_th: ติดตั้งตัวช่วยภาษา

source: License Information
th_th: ข้อมูลใบอนุญาติ

source: Download
th_th: ดาวน์โหลด

source: Install dictionary file only for Typora
th_th: ติดตั้งพจนานุกรมสำหรับ Typora เท่านั้น

source: Spell Check (%@ unavailable)
th_th: การตรวจตัวสะกด (%@ ไม่พร้อม)

source: Spell Check (%@ downloading)
th_th: การตรวจตัวสะกด (%@ กำลังดาวน์โหลด)

source: Download dictionary file for %@
th_th: ดาวน์โหลดไฟล์พจนานุกรมสำหรับ %@

source: (Default spell check option)
th_th: (ตัวเลือกสำหรับการตรวจตัวสะกดดั่งเดิม)

source: Failed to load spellcheck module
th_th: การโหลดโมดูลสำหรับตัวสะกดคำเกิดข้อผิดพลาด

source: <strong>%@</strong> has been turned on.
th_th: <strong>%@</strong> ถูกเปิด

source: You could turn it off from `View` menu.
th_th: คุณสามารถปิดมันได้จากเมนู `มุมมอง`
